Data Engineer / Data Science position at Zenit - *Take Home Assignment*
---------------------------------------------------

In this assignment you will go through several questions that together constitute a workflow of some basic data operations in Python. 
Each question builds up on the next.

First make sure you download and store the excel file *data.xlsx* locally and upload it here. The code to do this with is already in place below. The data consists of some master data on passengers that were onboard the Titanic and it is enriched with some extra (fictional) information on each passenger. The data does not always make sense, that is not a problem.

You will start with performing some SQL-like operations (but using pandas) on 3 datasets. The resulting dataframe will then be used to implement some cleaning rules on the data. Hereafter you can use the cleaned dataset to build up a SQL query which you will have to output.

**Please use Google Chrome.**


There is no real time limit, but it should be manageable in approximately one hour. The quality and efficiency of the code is most important. Good luck!

In [ ]:
# RUN THIS CELL FIRST
from google.colab import files
data = files.upload()

# Upload the `data.xlsx` file below...

Make sure the name of the file you uploaded is the same as the one below read by the `pd.read_excel()` function. If you don't make any changes everything will run correctly.

In [ ]:
# NOW RUN THIS CELL
import pandas as pd
import io

all_data_sets = pd.read_excel(io.BytesIO(data['data.xlsx']), sheet_name=None)

You now should have 3 seperate dataframes stored in `all_data_sets`. Do some checks to see if that is the case.

## Excercise 1
---------------------

The three datasets need to be joined so that we will end up with one dataframe on which the cleaning requirements are performed. 

#### **a)**
Create a new dataframe (e.g. `passenger_extended_df`) that extends the **passengers** table (second dataset in `all_data_sets`) with **extra** information (third dataset in `all_data_sets`). Investigate the data to find the join attribute(s).
Make sure that the resulting table contains all rows from
`passengers` dataset. Then remove those passengers that have a `nan` value for the `age` attribute age. 

#### **b)**
Obtain the the final dataframe by joining the **titanic** table with the dataframe created in **a)**. Again, analyse the data to find the proper join attribute(s).

In [ ]:
### Code for question 1a ###

In [ ]:
### Code for question 1b ###

# Exercise 2
------------------------------------------
Now that we have our data in one table we would like to do some cleaning. 

#### **a)**
We need a new column called `RequirementX` based on whether someone survived or not and on the `Embarked` value. Fill the column according to the following rule:
 - If a passenger survived and `Embarked` equals "NaN" or "S", the cell has to take the value *"..."* (three dots)
 - If a passenger survived and `Embarked` equals "C" or "Q", the cell has to take the value "*00A*"
 - If a passenger did not survive and `Embarked` equals "Q", the cell has to take the value  "*Passed with Q*"
 - Else, the cell has to take the value "*TBD*"


#### **b)** 
For all rows, delte all non-digit (1-9) characters in the "Ticket" column.

#### **c)**
If a passenger is born before 1965 clear out their `Email`.

#### **d)** 
Print the number of passengers that use *yahoo.com* as their `Email` provider.
 

#### **e)** 
Select 30 passengers, 15 that have completed High School and 15 that have done a Bachelor and keep only the columns `Sex`, `PassengerId`, `Education` and `Company`.
Rename the columns according to the following mapping: 
* `Sex` --> `st`
* `PassengerId` --> `sa`
* `Education` --> `tt`
* `Company` --> `ta`

Give this table a new name

In [ ]:
### Code for question 2a ###

In [ ]:
### Code for question 2b ###

In [ ]:
### Code for question 2c ###

In [ ]:
### Code for question 2d ###

In [ ]:
### Code for question 2e ###

# Excercise 3 
----------------------------------------

Using the more compact table from **2e)** we will structure a SQL like strings which your program should print to the screen. For each group in the `tt` column, we would like to have a seperate string. You are not expected to work with sql or provide real queries. Based on the dataframe, try to find a pattern for structuring the string.

Consider the following test dataframe:

In [ ]:
import pandas as pd
test_df_dic = {
    'st': ['A', 'B', 'A', 'Z', 'Z'], 
    'sa': ['001', '007', '40021', '90833', 'hello World'], 
    'tt': ['table1', 'table1', 'table1', 'table2', 'table2'],
    'ta': ['xa', 'xb', 'xc', 'ya', 'yb']
}
test_df = pd.DataFrame.from_dict(test_df_dic)
test_df

Your program should then output **exactly** this for **table1**:
```
SELECT A.`001` as `xa`, B.`007` as `xb`, A.`40021` as `xc` 
FROM schema.A + schema.B
```
And this for **table2**: 
```
SELECT Z.`90833` as `ya`, Z.`hello World` as `yb`
FROM schema.Z
```

Since your dataframe will have two distinct `tt` values by design, your code should output two strings. Note the use of backticks, and the fact that if there are multiple source tables you can just add them. In real life we would of course perform a join on some field.

In [ ]:
### Code for question 3 ###